[
    {
        "id": 1,
        "filename": "xahead.pdf",
        "text": "xahead\r\nWarum \"xahead\"?\r\nDer Name \"xahead\" steht für unsere Entschlossenheit, die Zukunft nicht nur zu erwarten, sondem sie zu gestalten. Das \"X\" im\r\nNamen trägt mehrere tiefgehende Bedeutungen. Als römische Ziffer für 10 verweist es darauf: dass wir stets 10 Jahre\r\nvorausdenkem In einer Zeit, in der sich die Möglichkeiten von Künstlicher Intelligenz exponentiell entfalten: ist es nicht genug,\r\nauf die Gegenwart zu reagieren — man muss die Zukunft aktiv antizipierem Wir denken zehn Jahre wraus, weil wir KI nicht\r\nnur nutzen, sondem sie zu einem strategischen Werkzeug erheben, das uns ermöglicht, die versteckten Pfade der Zukunft\r\nheute schon sichtbar zu machen\r\nDoch das \"X\" ist nicht nur eine Zahl Es steht auch für das Unbekannte — die Variable, die in der Wissenschaft und Mathematik\r\nfür das steht, was es noch zu entdecken gilt KI ist unser Kompass, der uns durch die komplexe, hohe latente Dimension\r\ndes Wissens navigiert, die bereits In Sprache: Daten und Prozessen verborgen liegt unsere Mission ist es, diese unbekannten\r\nzu entschlüsseln und versteckte Lösungen in dieser riesigen Dimension zu finden.\r\nDas \"ahead\" im Namen verkörpell unsere Fähigkeit, stets einen Schritt voraus zu sein KI bietet uns die einzigartige\r\nMöglichkeit, nicht nur Trends zu erkennen, sondern die zukünftige Realität aktiv zu gestalten. Wir sehen nicht nur die\r\nTechnologie wri heute — wir verstehen, wie KI die Regeln von Wirtschaft, Wissenschaf und Gesellschaft In den kommenden\r\nJahren neu definieren wird\r\nBei xahead geht es darum, die Vorsprünge durch Intelligenz zu nutzen — sowohl menschliche als auch maschinelle. unser\r\nZiel Ist es, die Symbiose zwischen Mensch und Maschine zu perfektionieren und die schöpferische Kran der KI In die Hände\r\nderjenigen zu legen, die den Mut haben, die nächste Dekade zu gestalten In einer Welt: in der die meisten nur auf das Hier und\r\nJetzt fokussiert Sind, nutzen wir Al als Hebel, um Unternehmen und Menschen zu befähigen, die nächsten zehn Jahre schon\r\nheute zu formen.\r\nxahead ist der Inbegriff von strategischer Voraussicht, intelligenter Nutzung von KI und der Fähigkeit, das Unbekannte\r\nzu entschlüsseln. Wir führen nicht nur die vierte industrielle Revolution an — wir definieren den Kurs für die nachste Dekade\r\nund darüber hinaus.\r\n",
        "status": "verarbeitet"
    },
    {
        "id": 2,
        "filename": "projekte_IBS.pdf",
        "text": "Studiengang Informatik\r\nProjekt-vorschläge Wiederholung „ Internetbasierte Systeme\"\r\n2024\r\n2024-07-12\r\nDiese Projekte ersetzen — da es sich um eine Wiederholung handelt — die regelmäßigen n:stat.e und das\r\nfreie\r\nEs gilt, generell dass die Projekte „out Of the box\" in einem Vermichnis unter den IBS-Backends (HTTP\r\n/ FastCGl, WS, MQH) laufen müssen. Es muss auch der lokale MQTT-Broker eingesetzt werden.\r\nDies sind Vorschläge die gerne noch erweitert und ausgeschmückt werden können.\r\nDer offizielle Workload ist ca. Wochen Vollzeit zzgl. 2-3 Tage prüfungsun•bereitung.\r\nDokumentenmanagementsystem\r\n• Mit der Kamera kann ein Dokument fotografiert und hodlgeladen werden. (Achtung, vermutlich\r\nHHPS notwendig)\r\nZusätzlich dazu können Dokumente in ein spezielles Verzeichnis kopiert werden.\r\n• Neue Dokumente werden in einem gewissen Turnus zu einem WWW-OCR-Scyvice\r\n• Verarbeitetet Dokumente werden einer „Datenbank\" (JS-Objekt) hinzugeführL\r\n• Eine Statusseite ermöglicht Beobachung incl. automatischer Aktualisierung diesc±; Prozesses.\r\n• eine einfachste Suchmaschine ermöglicht Suche, Treffer mit Kontextanzeigc und Dokumenten-vor-\r\nschau. (Muss durch neuc Dokumente nicht aktualisiert, werden)\r\nFoto-Web- Datenbank\r\n• Mit der Kamera kann ein Dokument fotografiert und hochgeladen werden zusätzlich werden die\r\naktuellen GPS-Koordinaten hochgeladen _ (Achtung, vermutlich notwendig)\r\n• Eine Seite (mit OpenLayers programmiert) zeigt die Positionen der mjt.os mit einer kleinen Vorschau\r\nan, durch Anclicken wird das l-'bto groß dargstellt.\r\n• Neu hinzugekommene Fotos werden in der Karte dynamisch nachgeladen\r\nMemory-Spiel\r\nWie bekannt...\r\nSensorauswertung\r\nLage- und Beschleunigungssensoren werden ausgelesen und kontinuierlich über Websockets an den\r\nServer gesendet. (Achtung, vermutlich HTTPS notwendig)\r\n• Auf dem Server werden die Daten ausgewertet (bspw. „zittert jemand„) und auf einer Monitor-seite\r\nwerden diese Auswertungen dargestellt\r\nProf.\r\n",
        "status": "verarbeitet"
    },
    {
        "id": 3,
        "filename": "projekte_IBS.pdf",
        "text": "Studiengang Informatik\r\nProjekt-vorschläge Wiederholung „ Internetbasierte Systeme\"\r\n2024\r\n2024-07-12\r\nDiese Projekte ersetzen — da es sich um eine Wiederholung handelt — die regelmäßigen n:stat.e und das\r\nfreie\r\nEs gilt, generell dass die Projekte „out Of the box\" in einem Vermichnis unter den IBS-Backends (HTTP\r\n/ FastCGl, WS, MQH) laufen müssen. Es muss auch der lokale MQTT-Broker eingesetzt werden.\r\nDies sind Vorschläge die gerne noch erweitert und ausgeschmückt werden können.\r\nDer offizielle Workload ist ca. Wochen Vollzeit zzgl. 2-3 Tage prüfungsun•bereitung.\r\nDokumentenmanagementsystem\r\n• Mit der Kamera kann ein Dokument fotografiert und hodlgeladen werden. (Achtung, vermutlich\r\nHHPS notwendig)\r\nZusätzlich dazu können Dokumente in ein spezielles Verzeichnis kopiert werden.\r\n• Neue Dokumente werden in einem gewissen Turnus zu einem WWW-OCR-Scyvice\r\n• Verarbeitetet Dokumente werden einer „Datenbank\" (JS-Objekt) hinzugeführL\r\n• Eine Statusseite ermöglicht Beobachung incl. automatischer Aktualisierung diesc±; Prozesses.\r\n• eine einfachste Suchmaschine ermöglicht Suche, Treffer mit Kontextanzeigc und Dokumenten-vor-\r\nschau. (Muss durch neuc Dokumente nicht aktualisiert, werden)\r\nFoto-Web- Datenbank\r\n• Mit der Kamera kann ein Dokument fotografiert und hochgeladen werden zusätzlich werden die\r\naktuellen GPS-Koordinaten hochgeladen _ (Achtung, vermutlich notwendig)\r\n• Eine Seite (mit OpenLayers programmiert) zeigt die Positionen der mjt.os mit einer kleinen Vorschau\r\nan, durch Anclicken wird das l-'bto groß dargstellt.\r\n• Neu hinzugekommene Fotos werden in der Karte dynamisch nachgeladen\r\nMemory-Spiel\r\nWie bekannt...\r\nSensorauswertung\r\nLage- und Beschleunigungssensoren werden ausgelesen und kontinuierlich über Websockets an den\r\nServer gesendet. (Achtung, vermutlich HTTPS notwendig)\r\n• Auf dem Server werden die Daten ausgewertet (bspw. „zittert jemand„) und auf einer Monitor-seite\r\nwerden diese Auswertungen dargestellt\r\nProf.\r\n",
        "status": "verarbeitet"
    },
    {
        "id": 4,
        "filename": "Siya_Skills.pdf",
        "text": "",
        "status": "Fehler bei Verarbeitung"
    },
    {
        "id": 5,
        "filename": "Kaufland.pdf",
        "text": "Kaufland ist eine führende deutsche Supermarktkette und Tell der Schwarz-Gruppe, die auch\r\nLidl umfasst Mit Hauptsitz in Neckarsulm betreibt Kaufland zahlreiche Filialen in Europa und\r\nfokussiert sich auf ein breites Produktsortiment, wettbewerbsfähige Preise sowie Qualität und\r\nNachhaltigkeit.\r\nUnternehmensüberblick:\r\nGeschichte und Expansion: Gegründet in den 1960er Jahren, expandierte Kaufland ab\r\nden 1990er Jahren in Europa, vor allem in Osteuropa.\r\n2\r\nGeschäftsmodell• Kaufland agiert als Hypermarché mit einem vielfältigen Angebot, von\r\nLebensmitteln bis zu Haushaltswaren und Elektronik, und bietet preisgünstige\r\nEigenmarken wie K-Classic und K-Bio an.\r\n3\r\nInternationalisierung: Kaufland ist in Ländern wie Polen, Tschechien, Rumänien und\r\nBulgarien präsent und passt das Sortiment an lokale Bedürfnisse an.\r\nStrategie und Ziele. Die Strategie basielt auf Preis-Leistungs-Verhältnis, Nachhaltigkeit\r\nund Digitalisierung, wie durch die Kaufland-App und Online-Lieferdienste unterstützt.\r\n5\r\nNachhaltigkeit: Kaufland reduziert Plastik, bekämpft Lebensmittelverschwendung und\r\nfördert fairen Handel\r\nMitarbeitende und Kultur: Mit über 150.000 Mitarbeitenden weltweit fördert Kaufland\r\nDiversität und bietet Weiterbildungsprogramme.\r\n7\r\nWettbewerb: Auf dem Markt konkurriert Kaufland mit Edeka, Rewe, Aldi, Lidl und weiteren\r\ninternationalen Händlern wie Carrefour\r\nZukunftsperspektiven: Die Schwerpunkte liegen auf Nachhaltigkeit und Digitalisierung,\r\num Kauflands Position im europäischen Einzelhandel weiter zu stärken.\r\nInsgesamt veffolgt Kaufland eine kundenorientierte Strategie, die auf Qualität, Innovation und\r\nVerantwortung setzt, und ist ein starker Akteur im europäischen Einzelhandel.\r\n",
        "status": "verarbeitet"
    },
    {
        "id": 6,
        "filename": "KI-and-Prompt-Engineering-Handout-fur-Menrad.pdf",
        "text": "",
        "status": "Fehler bei Verarbeitung"
    },
    {
        "id": 7,
        "filename": "WhatsApp_Image_2024-07-12_at_11.03.44.jpeg",
        "text": "Studiengang Jnformøtik\r\nPrüfung \"Jntcrnctbngiertc SY%t.erncS'\r\nmc / Matrikclnr:\r\nufgabc 1: HTTP-Protokoll\r\nufmben•,\r\ngg 2024\r\n2024-07-12\r\na) Wic kann ein IWI'P-CIicnt erkennen, um welcheg Datenformat egøjc}i bei einer (JRL haudeJf'! (Zwei\r\nWclcbc die bcøwrc?)\r\nb) Welche Möv)iclJY.citcn bietet JI\"CJ'P-Prot.okoIj, cin Server ('jentg auwjnzn-\r\ndcrljhlt„';' Sie, bei Ihrer Antwort auch die Mö%JicJjkcit, daw ein Jhowvgr mehrere Tabulztnen\r\noffen haben kann und ob wic dicv,c „verwijicdenc Cljcntgg behandelt werden können,\r\nAufgabe 2: Systcrncnt,wicklung\r\nBOIlen ein AJAX-longiert\"\" entwickeln, auf \"ich zwei Anwender auf einer Karte\r\ngie den eiwncn Standort und die Standort.c der anderen TciJnchmcr. Djc Pogjtjoncn der\r\nbeiden Anwender (1er % min wollen Polygon z,B, in Google-Math oder eincr anderen APJ (egpJ)\r\nwerden, Anwender bciflc\r\ngrnfiuh, wic Synt.crn aufgebaut iht,\r\nb) Event* im client\"'itigen Progrojnm werden benötigt? (Klartext reJcJjt), Denken Sie auch\r\nAnwender crf/ihrt, wenn \"ich der andere von der Anwendung verabschiedet hat.\r\nc) Dink'it,iercn Mio kurz Vor. und Nuhtcilc von synchronem und a.qynchronejn AJAX Jn Bezug auf Ihr\r\n%yflejn Sio \"ich mit Begründung for cine Art,\r\nd) Nonnen droi Alternativen dio Iller bctøsor w/iren AJAX und djhkutJcrcn Sje Vor- und Nachteile\r\nAufgab\",\r\nAufgabe 3: Autorisierung\r\nn) WOB von CrcdcntJoJh zu beachten?\r\nb) vor. und von Auth und Auth Beurer? Bedenken Sic vor\r\no) Wlo prJnzJpJoll 0/1 ut,h2?\r\n/lurgobo d: Mult;iutgor\r\n80 Anwender dot, gleiche rev,rviercn.\r\nmorgen, nicht verarbeiten,\r\no) IV/0 MVCCgoJöt'l wordon?\r\nb) IV/o Somop\"oron worden?\r\n1\r\n",
        "status": "verarbeitet"
    },
    {
        "id": 8,
        "filename": "Warum_macht_ein_RAG-System_in_Bezug_auf_Kosten_und_Effizienz_mehr_Sinn_als_ein_herkommlicher_Chatbot.pdf",
        "text": "",
        "status": "Fehler bei Verarbeitung"
    }
]